----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 112, 112]             864
       BatchNorm2d-2         [-1, 32, 112, 112]              64
             ReLU6-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]             288
       BatchNorm2d-5         [-1, 32, 112, 112]              64
             ReLU6-6         [-1, 32, 112, 112]               0
            Conv2d-7         [-1, 16, 112, 112]             512
       BatchNorm2d-8         [-1, 16, 112, 112]              32
  InvertedResidual-9         [-1, 16, 112, 112]               0
           Conv2d-10         [-1, 96, 112, 112]           1,536
      BatchNorm2d-11         [-1, 96, 112, 112]             192
            ReLU6-12         [-1, 96, 112, 112]               0
           Conv2d-13           [-1, 96, 56, 56]             864
      BatchNorm2d-14           [-1, 96, 56, 56]             192
            ReLU6-15           [-1, 96, 56, 56]               0
           Conv2d-16           [-1, 24, 56, 56]           2,304
      BatchNorm2d-17           [-1, 24, 56, 56]              48
 InvertedResidual-18           [-1, 24, 56, 56]               0
           Conv2d-19          [-1, 144, 56, 56]           3,456
    TemporalShift-20          [-1, 144, 56, 56]               0
      BatchNorm2d-21          [-1, 144, 56, 56]             288
            ReLU6-22          [-1, 144, 56, 56]               0
           Conv2d-23          [-1, 144, 56, 56]           1,296
      BatchNorm2d-24          [-1, 144, 56, 56]             288
            ReLU6-25          [-1, 144, 56, 56]               0
           Conv2d-26           [-1, 24, 56, 56]           3,456
      BatchNorm2d-27           [-1, 24, 56, 56]              48
 InvertedResidual-28           [-1, 24, 56, 56]               0
           Conv2d-29          [-1, 144, 56, 56]           3,456
      BatchNorm2d-30          [-1, 144, 56, 56]             288
            ReLU6-31          [-1, 144, 56, 56]               0
           Conv2d-32          [-1, 144, 28, 28]           1,296
      BatchNorm2d-33          [-1, 144, 28, 28]             288
            ReLU6-34          [-1, 144, 28, 28]               0
           Conv2d-35           [-1, 32, 28, 28]           4,608
      BatchNorm2d-36           [-1, 32, 28, 28]              64
 InvertedResidual-37           [-1, 32, 28, 28]               0
           Conv2d-38          [-1, 192, 28, 28]           6,144
    TemporalShift-39          [-1, 192, 28, 28]               0
      BatchNorm2d-40          [-1, 192, 28, 28]             384
            ReLU6-41          [-1, 192, 28, 28]               0
           Conv2d-42          [-1, 192, 28, 28]           1,728
      BatchNorm2d-43          [-1, 192, 28, 28]             384
            ReLU6-44          [-1, 192, 28, 28]               0
           Conv2d-45           [-1, 32, 28, 28]           6,144
      BatchNorm2d-46           [-1, 32, 28, 28]              64
 InvertedResidual-47           [-1, 32, 28, 28]               0
           Conv2d-48          [-1, 192, 28, 28]           6,144
    TemporalShift-49          [-1, 192, 28, 28]               0
      BatchNorm2d-50          [-1, 192, 28, 28]             384
            ReLU6-51          [-1, 192, 28, 28]               0
           Conv2d-52          [-1, 192, 28, 28]           1,728
      BatchNorm2d-53          [-1, 192, 28, 28]             384
            ReLU6-54          [-1, 192, 28, 28]               0
           Conv2d-55           [-1, 32, 28, 28]           6,144
      BatchNorm2d-56           [-1, 32, 28, 28]              64
 InvertedResidual-57           [-1, 32, 28, 28]               0
           Conv2d-58          [-1, 192, 28, 28]           6,144
      BatchNorm2d-59          [-1, 192, 28, 28]             384
            ReLU6-60          [-1, 192, 28, 28]               0
           Conv2d-61          [-1, 192, 14, 14]           1,728
      BatchNorm2d-62          [-1, 192, 14, 14]             384
            ReLU6-63          [-1, 192, 14, 14]               0
           Conv2d-64           [-1, 64, 14, 14]          12,288
      BatchNorm2d-65           [-1, 64, 14, 14]             128
 InvertedResidual-66           [-1, 64, 14, 14]               0
           Conv2d-67          [-1, 384, 14, 14]          24,576
    TemporalShift-68          [-1, 384, 14, 14]               0
      BatchNorm2d-69          [-1, 384, 14, 14]             768
            ReLU6-70          [-1, 384, 14, 14]               0
           Conv2d-71          [-1, 384, 14, 14]           3,456
      BatchNorm2d-72          [-1, 384, 14, 14]             768
            ReLU6-73          [-1, 384, 14, 14]               0
           Conv2d-74           [-1, 64, 14, 14]          24,576
      BatchNorm2d-75           [-1, 64, 14, 14]             128
 InvertedResidual-76           [-1, 64, 14, 14]               0
           Conv2d-77          [-1, 384, 14, 14]          24,576
    TemporalShift-78          [-1, 384, 14, 14]               0
      BatchNorm2d-79          [-1, 384, 14, 14]             768
            ReLU6-80          [-1, 384, 14, 14]               0
           Conv2d-81          [-1, 384, 14, 14]           3,456
      BatchNorm2d-82          [-1, 384, 14, 14]             768
            ReLU6-83          [-1, 384, 14, 14]               0
           Conv2d-84           [-1, 64, 14, 14]          24,576
      BatchNorm2d-85           [-1, 64, 14, 14]             128
 InvertedResidual-86           [-1, 64, 14, 14]               0
           Conv2d-87          [-1, 384, 14, 14]          24,576
    TemporalShift-88          [-1, 384, 14, 14]               0
      BatchNorm2d-89          [-1, 384, 14, 14]             768
            ReLU6-90          [-1, 384, 14, 14]               0
           Conv2d-91          [-1, 384, 14, 14]           3,456
      BatchNorm2d-92          [-1, 384, 14, 14]             768
            ReLU6-93          [-1, 384, 14, 14]               0
           Conv2d-94           [-1, 64, 14, 14]          24,576
      BatchNorm2d-95           [-1, 64, 14, 14]             128
 InvertedResidual-96           [-1, 64, 14, 14]               0
           Conv2d-97          [-1, 384, 14, 14]          24,576
      BatchNorm2d-98          [-1, 384, 14, 14]             768
            ReLU6-99          [-1, 384, 14, 14]               0
          Conv2d-100          [-1, 384, 14, 14]           3,456
     BatchNorm2d-101          [-1, 384, 14, 14]             768
           ReLU6-102          [-1, 384, 14, 14]               0
          Conv2d-103           [-1, 96, 14, 14]          36,864
     BatchNorm2d-104           [-1, 96, 14, 14]             192
InvertedResidual-105           [-1, 96, 14, 14]               0
          Conv2d-106          [-1, 576, 14, 14]          55,296
   TemporalShift-107          [-1, 576, 14, 14]               0
     BatchNorm2d-108          [-1, 576, 14, 14]           1,152
           ReLU6-109          [-1, 576, 14, 14]               0
          Conv2d-110          [-1, 576, 14, 14]           5,184
     BatchNorm2d-111          [-1, 576, 14, 14]           1,152
           ReLU6-112          [-1, 576, 14, 14]               0
          Conv2d-113           [-1, 96, 14, 14]          55,296
     BatchNorm2d-114           [-1, 96, 14, 14]             192
InvertedResidual-115           [-1, 96, 14, 14]               0
          Conv2d-116          [-1, 576, 14, 14]          55,296
   TemporalShift-117          [-1, 576, 14, 14]               0
     BatchNorm2d-118          [-1, 576, 14, 14]           1,152
           ReLU6-119          [-1, 576, 14, 14]               0
          Conv2d-120          [-1, 576, 14, 14]           5,184
     BatchNorm2d-121          [-1, 576, 14, 14]           1,152
           ReLU6-122          [-1, 576, 14, 14]               0
          Conv2d-123           [-1, 96, 14, 14]          55,296
     BatchNorm2d-124           [-1, 96, 14, 14]             192
InvertedResidual-125           [-1, 96, 14, 14]               0
          Conv2d-126          [-1, 576, 14, 14]          55,296
     BatchNorm2d-127          [-1, 576, 14, 14]           1,152
           ReLU6-128          [-1, 576, 14, 14]               0
          Conv2d-129            [-1, 576, 7, 7]           5,184
     BatchNorm2d-130            [-1, 576, 7, 7]           1,152
           ReLU6-131            [-1, 576, 7, 7]               0
          Conv2d-132            [-1, 160, 7, 7]          92,160
     BatchNorm2d-133            [-1, 160, 7, 7]             320
InvertedResidual-134            [-1, 160, 7, 7]               0
          Conv2d-135            [-1, 960, 7, 7]         153,600
   TemporalShift-136            [-1, 960, 7, 7]               0
     BatchNorm2d-137            [-1, 960, 7, 7]           1,920
           ReLU6-138            [-1, 960, 7, 7]               0
          Conv2d-139            [-1, 960, 7, 7]           8,640
     BatchNorm2d-140            [-1, 960, 7, 7]           1,920
           ReLU6-141            [-1, 960, 7, 7]               0
          Conv2d-142            [-1, 160, 7, 7]         153,600
     BatchNorm2d-143            [-1, 160, 7, 7]             320
InvertedResidual-144            [-1, 160, 7, 7]               0
          Conv2d-145            [-1, 960, 7, 7]         153,600
   TemporalShift-146            [-1, 960, 7, 7]               0
     BatchNorm2d-147            [-1, 960, 7, 7]           1,920
           ReLU6-148            [-1, 960, 7, 7]               0
          Conv2d-149            [-1, 960, 7, 7]           8,640
     BatchNorm2d-150            [-1, 960, 7, 7]           1,920
           ReLU6-151            [-1, 960, 7, 7]               0
          Conv2d-152            [-1, 160, 7, 7]         153,600
     BatchNorm2d-153            [-1, 160, 7, 7]             320
InvertedResidual-154            [-1, 160, 7, 7]               0
          Conv2d-155            [-1, 960, 7, 7]         153,600
     BatchNorm2d-156            [-1, 960, 7, 7]           1,920
           ReLU6-157            [-1, 960, 7, 7]               0
          Conv2d-158            [-1, 960, 7, 7]           8,640
     BatchNorm2d-159            [-1, 960, 7, 7]           1,920
           ReLU6-160            [-1, 960, 7, 7]               0
          Conv2d-161            [-1, 320, 7, 7]         307,200
     BatchNorm2d-162            [-1, 320, 7, 7]             640
InvertedResidual-163            [-1, 320, 7, 7]               0
          Conv2d-164           [-1, 1280, 7, 7]         409,600
     BatchNorm2d-165           [-1, 1280, 7, 7]           2,560
           ReLU6-166           [-1, 1280, 7, 7]               0
         Dropout-167                 [-1, 1280]               0
     MobileNetV2-168                 [-1, 1280]               0
          Linear-169                    [-1, 2]           2,562
 ConsensusModule-170                 [-1, 1, 2]               0
             TSN-171                    [-1, 2]               0
================================================================
Total params: 2,226,434
Trainable params: 2,226,434
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 4.59
Forward/backward pass size (MB): 162.77
Params size (MB): 8.49
Estimated Total Size (MB): 175.86
----------------------------------------------------------------
